#### WorksetTable Members

---

|  |
| --- |
| WorksetTable Class   Methods   Properties   See Also |

The  WorksetTable  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CanDeleteWorkset | Indicates if a workset can be deleted. |
| Public method Static member | DeleteWorkset | Delete the specific workset. |
| Public method | Dispose | Releases all resources used by the  WorksetTable |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetActiveWorksetId | Returns the active workset's WorksetId. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetWorkset(Guid) | Returns the workset from a input Guid. |
| Public method | GetWorkset(WorksetId) | Returns the workset from a input WorksetId. |
| Public method Static member | IsWorksetNameUnique | Checks if the given workset name is unique in the document. |
| Public method Static member | RenameWorkset | Renames the workset. |
| Public method | SetActiveWorksetId | Sets the active workset. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

WorksetTable Class

Autodesk.Revit.DB Namespace